from string import Template
### قوالب RAG ###

system_prompt = Template("\n".join([
    "أنت مساعد ذكاء اصطناعي ذكي للغاية يساعد المستخدمين في العثور على المعلومات بكفاءة.",
    "استخدم السياق المقدم للإجابة على سؤال المستخدم بدقة وباختصار.",
    "إذا لم يحتوي السياق على معلومات ذات صلة، فأجب بعبارة: 'عذرًا، لم أتمكن من العثور على معلومات ذات صلة للإجابة على سؤالك.'"
]))

document_prompt = Template("\n".join([
    "## المستند: $doc_num",
    "### المحتوى: $chunk_text"
]))

footer_prompt = Template("\n".join([
    "بناءً على المستندات أعلاه، أجب عن السؤال التالي:",
    "## السؤال: $user_question",
    "## الإجابة: $answer"
]))